jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
        if(g_Parameter[CFG_PRO_VOL_M] == 0)
        {
            if(g_Parameter[CFG_PRO_VOL_N] == 0)
            {
                g_Alpha[ALPHA_UxIx] = CalculateAngleU_I(FFT_InputBufUa[1][3], FFT_InputBufUa[1][2], FFT_InputBufUA[1][3], FFT_InputBufUA[1][2]) - g_CalibrateFactor[CALIFACTOR_ALPHA_UxUx];
            }
            else
            {
                g_Alpha[ALPHA_UxIx] = CalculateAngleU_I(FFT_InputBufUa[1][3], FFT_InputBufUa[1][2], FFT_InputBufUC[1][3], FFT_InputBufUC[1][2]) - g_CalibrateFactor[CALIFACTOR_ALPHA_UxUx];
            }        
        }
        else
        {
            if(g_Parameter[CFG_PRO_VOL_N] == 0)
            {
                g_Alpha[ALPHA_UxIx] = CalculateAngleU_I(FFT_InputBufUc[1][3], FFT_InputBufUc[1][2], FFT_InputBufUA[1][3], FFT_InputBufUA[1][2]) - g_CalibrateFactor[CALIFACTOR_ALPHA_UxUx];
            }
            else
            {
                g_Alpha[ALPHA_UxIx] = CalculateAngleU_I(FFT_InputBufUc[1][3], FFT_InputBufUc[1][2], FFT_InputBufUC[1][3], FFT_InputBufUC[1][2]) - g_CalibrateFactor[CALIFACTOR_ALPHA_UxUx];
            }        
        }
    }

    if(g_Parameter[CFG_POW_VOL_AB] == 0)
    {
        Ua = CalcAverage(VUa, CALC_TIMES) * VOLTAGE_RADIO;
        Ua3 = CalcAverage(VUa3, CALC_TIMES) * VOLTAGE_RADIO;
        Ua5 = CalcAverage(VUa5, CALC_TIMES) * VOLTAGE_RADIO;       
    }
    else
    {
        UA = CalcAverage(VUA, CALC_TIMES) * VOLTAGE_RADIO;
        UA3 = CalcAverage(VUA3, CALC_TIMES) * VOLTAGE_RADIO;
        UA5 = CalcAverage(VUA5, CALC_TIMES) * VOLTAGE_RADIO; 
    }

    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        Uc = CalcAverage(VUc, CALC_TIMES) * VOLTAGE_RADIO;
        Uc3 = CalcAverage(VUc3, CALC_TIMES) * VOLTAGE_RADIO;
        Uc5 = CalcAverage(VUc5, CALC_TIMES) * VOLTAGE_RADIO;
    } 
    else
    {
        UC = CalcAverage(VUC, CALC_TIMES) * VOLTAGE_RADIO;
        UC3 = CalcAverage(VUC3, CALC_TIMES) * VOLTAGE_RADIO;
        UC5 = CalcAverage(VUC5, CALC_TIMES) * VOLTAGE_RADIO;    
    }
    
    Ub = CalcAverage(VUb, CALC_TIMES) * VOLTAGE_RADIO;    
    U0 = CalcAverage(VU0, CALC_TIMES) * VOLTAGE_RADIO;

    
    Ub3 = CalcAverage(VUb3, CALC_TIMES) * VOLTAGE_RADIO;    
    U03 = CalcAverage(VU03, CALC_TIMES) * VOLTAGE_RADIO;

    
    Ub5 = CalcAverage(VUb5, CALC_TIMES) * VOLTAGE_RADIO;    
    U05 = CalcAverage(VU05, CALC_TIMES) * VOLTAGE_RADIO;

    Ia = CalcAverage(VIa, CALC_TIMES) * CURRENT_RADIO;
    Ib = CalcAverage(VIb, CALC_TIMES) * CURRENT_RADIO;
    Ic = CalcAverage(VIc, CALC_TIMES) * CURRENT_RADIO;
    I0 = CalcAverage(VI0, CALC_TIMES) * CURRENT_RADIO;

    //printf("%f  %f  %f\n", Ia,Ib,Uc);
    Ia2 = CalcAverage(VIa2, CALC_TIMES) * CURRENT_RADIO;
    Ib2 = CalcAverage(VIb2, CALC_TIMES) * CURRENT_RADIO;
    Ic2 = CalcAverage(VIc2, CALC_TIMES) * CURRENT_RADIO;
	
    Ia3 = CalcAverage(VIa3, CALC_TIMES) * CURRENT_RADIO;
    Ib3 = CalcAverage(VIb3, CALC_TIMES) * CURRENT_RADIO;
    Ic3 = CalcAverage(VIc3, CALC_TIMES) * CURRENT_RADIO;
    I03 = CalcAverage(VI03, CALC_TIMES) * CURRENT_RADIO;

    Ia5 = CalcAverage(VIa5, CALC_TIMES) * CURRENT_RADIO;
    Ib5 = CalcAverage(VIb5, CALC_TIMES) * CURRENT_RADIO;
    Ic5 = CalcAverage(VIc5, CALC_TIMES) * CURRENT_RADIO;
    I05 = CalcAverage(VI05, CALC_TIMES) * CURRENT_RADIO;
    
    UA = CalcAverage(VUA, CALC_TIMES) * VOLTAGE_RADIO;
    UC = CalcAverage(VUC, CALC_TIMES) * VOLTAGE_RADIO;

	for (i = 0; i < ADC_SAMPLE_NUM; i++)
	{
		Udc1 += g_Udc1SampleBuf[i];
		Udc2 += g_Udc2SampleBuf[i];
	}   
	
	Udc1 /= ADC_SAMPLE_NUM;
	Udc2 /= ADC_SAMPLE_NUM;

    if(g_Parameter[CFG_POW_VOL_AB] == 0)
    {
        Ua3 = Ua3 * g_CalibrateFactor[CALIFACTOR_Uab];
        Ua5 = Ua5 * g_CalibrateFactor[CALIFACTOR_Uab];
    }
    else
    {
        UA3 = UA3 * g_CalibrateFactor[CALIFACTOR_Uab];
        UA5 = UA5 * g_CalibrateFactor[CALIFACTOR_Uab];   
    }	
    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        Uc3 = Uc3 * g_CalibrateFactor[CALIFACTOR_Ucb];
        Uc5 = Uc5 * g_CalibrateFactor[CALIFACTOR_Ucb];
    }
    else
    {
        UC3 = UC3 * g_CalibrateFactor[CALIFACTOR_Ucb];
        UC5 = UC5 * g_CalibrateFactor[CALIFACTOR_Ucb];    
    }
        
    Ua = Ua * g_CalibrateFactor[CALIFACTOR_Uab];    
    Ub = Ub * g_CalibrateFactor[CALIFACTOR_Uac];
    Ub3 = Ub3 * g_CalibrateFactor[CALIFACTOR_Uac];
    Ub5 = Ub5 * g_CalibrateFactor[CALIFACTOR_Uac];    
    Uc = Uc * g_CalibrateFactor[CALIFACTOR_Ucb];     
    U0 = U0 * g_CalibrateFactor[CALIFACTOR_U0];
    U03 = U03 * g_CalibrateFactor[CALIFACTOR_U0];
    U05 = U05 * g_CalibrateFactor[CALIFACTOR_U0];    
    Ia = Ia * g_CalibrateFactor[CALIFACTOR_Ia];
	Ia2 = Ia2 * g_CalibrateFactor[CALIFACTOR_Ia];
    Ia3 = Ia3 * g_CalibrateFactor[CALIFACTOR_Ia];
    Ia5 = Ia5 * g_CalibrateFactor[CALIFACTOR_Ia];    
    Ib = Ib * g_CalibrateFactor[CALIFACTOR_Ib];
	Ib2 = Ib2 * g_CalibrateFactor[CALIFACTOR_Ib];
    Ib3 = Ib3 * g_CalibrateFactor[CALIFACTOR_Ib];
    Ib5 = Ib5 * g_CalibrateFactor[CALIFACTOR_Ib];    
    Ic = Ic * g_CalibrateFactor[CALIFACTOR_Ic];
	Ic2 = Ic2 * g_CalibrateFactor[CALIFACTOR_Ic];
    Ic3 = Ic3 * g_CalibrateFactor[CALIFACTOR_Ic];
    Ic5 = Ic5 * g_CalibrateFactor[CALIFACTOR_Ic];    
    I0 = I0 * g_CalibrateFactor[CALIFACTOR_I0];
    I03 = I03 * g_CalibrateFactor[CALIFACTOR_I0];
    I05 = I05 * g_CalibrateFactor[CALIFACTOR_I0];    
    UA = UA * g_CalibrateFactor[CALIFACTOR_UAB];
    UC = UC * g_CalibrateFactor[CALIFACTOR_UCB];   
    Udc1 = Udc1 * g_CalibrateFactor[CALIFACTOR_DC1];
    Udc2 = Udc2 * g_CalibrateFactor[CALIFACTOR_DC2];  

//    ParameterCheck(ZERODRIFT);

    if (Ua < g_Parameter[ZERODRIFT_Uab])Ua = 0;
    if (Ub < g_Parameter[ZERODRIFT_Uac])Ub = 0;
    if (Uc < g_Parameter[ZERODRIFT_Ucb])Uc = 0;
    if (U0 < g_Parameter[ZERODRIFT_U0]) U0 = 0;
    if (Ia < g_Parameter[ZERODRIFT_Ia]) Ia = 0;
    if (Ib < g_Parameter[ZERODRIFT_Ib]) Ib = 0;
    if (Ic < g_Parameter[ZERODRIFT_Ic]) Ic = 0;
    if (I0 < g_Parameter[ZERODRIFT_I0]) I0 = 0;
    if (UA < g_Parameter[ZERODRIFT_UAB])UA = 0;
    if (UC < g_Parameter[ZERODRIFT_UCB])UC = 0;
    if (Udc1 < g_Parameter[ZERODRIFT_DC1])Udc1 = 0;
    if (Udc2 < g_Parameter[ZERODRIFT_DC2])Udc2 = 0;
    
