jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
    if(g_Parameter[CFG_POW_VOL_AB] == 0)
    {
        Pa = Ua * Ia * cos(g_Alpha[ALPHA_UabIa] * FACTOR_ANGLE_TO_RAD);  
        Qa = Ua * Ia * sin(g_Alpha[ALPHA_UabIa] * FACTOR_ANGLE_TO_RAD);        
    }
    else
    {
        Pa = UA * Ia * cos(g_Alpha[ALPHA_UabIa] * FACTOR_ANGLE_TO_RAD); 
        Qa = UA * Ia * sin(g_Alpha[ALPHA_UabIa] * FACTOR_ANGLE_TO_RAD);        
    }
        
    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {  
        Pc = Uc * Ic * cos(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);
        Qc = Uc * Ic * sin(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);
    }
    else
    {
        Pc = UC * Ic * cos(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);
        Qc = UC * Ic * sin(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);    
    }
   
    Pb = 0; //Ub * Ib * cos(g_Alpha[1] * FACTOR_ANGLE_TO_RAD);
    P = (Pa + Pb + Pc) / 1000.0f;
   
    Qb = 0; //Ub * Ib * sin(g_Alpha[1] * FACTOR_ANGLE_TO_RAD);
    Q = (Qa + Qb + Qc) / 1000.0f;

    S = sqrt(P * P + Q * Q);
    F = P / S;

    P = fabs(P) < g_Parameter[ZERODRIFT_P] ? 0 : P;
    Q = fabs(Q) < g_Parameter[ZERODRIFT_Q] ? 0 : Q;
    S = fabs(S) < g_Parameter[ZERODRIFT_S] ? 0 : S;

    g_TelemetryDB[ADDR_Uab]= Ua;
    g_TelemetryDB[ADDR_Ucb] = Uc;
    g_TelemetryDB[ADDR_Uac] = Ub;
    g_TelemetryDB[ADDR_U0] = U0;

    g_TelemetryDB[ADDR_UAB] = UA;
    g_TelemetryDB[ADDR_UCB] = UC;
    
    g_TelemetryDB[ADDR_IA] = Ia;
    g_TelemetryDB[ADDR_IB] = Ib;
    g_TelemetryDB[ADDR_IC] = Ic;
    g_TelemetryDB[ADDR_I0] = I0;

    g_TelemetryDB[ADDR_P] = P;
    g_TelemetryDB[ADDR_Q] = Q;
    g_TelemetryDB[ADDR_S] = S;
    g_TelemetryDB[ADDR_PF] = F;

	g_TelemetryDB[ADDR_DC1] = Udc1;
	g_TelemetryDB[ADDR_DC2] = Udc2;
	
    if((g_TelemetryDB[ADDR_U0] == 0)||(g_TelemetryDB[ADDR_I0] == 0))
    {g_TelemetryDB[ADDR_AIPHY_U0_I0] = 0;}
    else       
    {
        while(g_Alpha[ALPHA_U0I0]<-180)
        {g_Alpha[ALPHA_U0I0] += 360;}
        while(g_Alpha[ALPHA_U0I0]>180)
        {g_Alpha[ALPHA_U0I0] -= 360;}
        g_TelemetryDB[ADDR_AIPHY_U0_I0] = g_Alpha[ALPHA_U0I0];
    }

    if((((g_Parameter[CFG_PRO_VOL_M] == 0)&&(g_TelemetryDB[ADDR_Uab] == 0))||\
        ((g_Parameter[CFG_PRO_VOL_M] == 1)&&(g_TelemetryDB[ADDR_Ucb] == 0)))||\
        (((g_Parameter[CFG_PRO_VOL_N] == 0)&&(g_TelemetryDB[ADDR_UAB] == 0))||\
        ((g_Parameter[CFG_PRO_VOL_N] == 1)&&(g_TelemetryDB[ADDR_UCB] == 0))))
    {g_TelemetryDB[ADDR_ALPHY_Ux_Ux] = 0;}
    else       
    {
        if(g_Alpha[ALPHA_UxIx]<-180)
        {g_Alpha[ALPHA_UxIx] += 360;}
        if(g_Alpha[ALPHA_UxIx]>180)
        {g_Alpha[ALPHA_UxIx] -= 360;}
        g_TelemetryDB[ADDR_ALPHY_Ux_Ux] = g_Alpha[ALPHA_UxIx];
    }
	
    g_TelemetryDB[ADDR_Uab_ONCE] = Ua * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_Ubc_ONCE] = Uc * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_Uca_ONCE] = Ub * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_U0_ONCE] = U0 * (g_Parameter[RATIO_U0_ONE_TURN] / g_Parameter[RATIO_U0_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_UBC_ONCE] = UC * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryDB[ADDR_UAB_ONCE] = UA * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
	
    g_TelemetryDB[ADDR_Ia_ONCE] = Ia * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_Ib_ONCE] = Ib * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);    
    g_TelemetryDB[ADDR_Ic_ONCE] = Ic * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_I0_ONCE] = I0 * (g_Parameter[RATIO_I0_ONE_TURN] / g_Parameter[RATIO_I0_SECONDARY]);

    g_TelemetryDB[ADDR_P_ONCE] = P * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_Q_ONCE] = Q * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryDB[ADDR_S_ONCE] = S * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);

    if(g_Parameter[CFG_POW_VOL_AB] == 0)
    {
        if (Ua3 < g_Parameter[ZERODRIFT_Uab])Ua3 = 0;
        if (Ua5 < g_Parameter[ZERODRIFT_Uab])Ua5 = 0;
    }
    else
    {
        if (UA3 < g_Parameter[ZERODRIFT_Uab])UA3 = 0;
        if (UA5 < g_Parameter[ZERODRIFT_Uab])UA5 = 0;
    }

    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        if (Uc3 < g_Parameter[ZERODRIFT_Ucb])Uc3 = 0;
        if (Uc5 < g_Parameter[ZERODRIFT_Ucb])Uc5 = 0;
    }
    else
    {
        if (UC3 < g_Parameter[ZERODRIFT_Ucb])UC3 = 0;
        if (UC5 < g_Parameter[ZERODRIFT_Ucb])UC5 = 0;
    }
        
    if (Ub3 < g_Parameter[ZERODRIFT_Uac])Ub3 = 0;    
    if (U03 < g_Parameter[ZERODRIFT_U0]) U03 = 0;
    	
	if (Ia2 < g_Parameter[ZERODRIFT_Ia]) Ia2 = 0;
	if (Ib2 < g_Parameter[ZERODRIFT_Ib]) Ib2 = 0;
	if (Ic2 < g_Parameter[ZERODRIFT_Ic]) Ic2 = 0;
	
    if (Ia3 < g_Parameter[ZERODRIFT_Ia]) Ia3 = 0;
    if (Ib3 < g_Parameter[ZERODRIFT_Ib]) Ib3 = 0;
    if (Ic3 < g_Parameter[ZERODRIFT_Ic]) Ic3 = 0;
    if (I03 < g_Parameter[ZERODRIFT_I0]) I03 = 0;

    
    if (Ub5 < g_Parameter[ZERODRIFT_Uac])Ub5 = 0;    
    if (U05 < g_Parameter[ZERODRIFT_U0]) U05 = 0;
    if (Ia5 < g_Parameter[ZERODRIFT_Ia]) Ia5 = 0;
    if (Ib5 < g_Parameter[ZERODRIFT_Ib]) Ib5 = 0;
    if (Ic5 < g_Parameter[ZERODRIFT_Ic]) Ic5 = 0;
    if (I05 < g_Parameter[ZERODRIFT_I0]) I05 = 0;
    
    g_secondHarmonicIa = Ia2;
	g_secondHarmonicIb = Ib2;
	g_secondHarmonicIc = Ic2;

    if(g_Parameter[CFG_POW_VOL_AB] == 0)
    {
        g_TelemetryDB[THIRDHARMONIC_Uab] = Ua3; 
        g_TelemetryDB[THIRDHARMONIC_Uab] = Ua5;
    }
    else
    {
        g_TelemetryDB[THIRDHARMONIC_Uab] = UA3; 
        g_TelemetryDB[THIRDHARMONIC_Uab] = UA5;    
    }
    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        g_TelemetryDB[THIRDHARMONIC_Ubc] = Uc3;
        g_TelemetryDB[THIRDHARMONIC_Ubc] = Uc5;
    }
    else
    {
        g_TelemetryDB[THIRDHARMONIC_Ubc] = UC3;
        g_TelemetryDB[THIRDHARMONIC_Ubc] = UC5;    
    }
            
    g_TelemetryDB[THIRDHARMONIC_Uca] = Ub3;
    g_TelemetryDB[THIRDHARMONIC_U0] = U03;
    g_TelemetryDB[THIRDHARMONIC_Ia] = Ia3;
    g_TelemetryDB[THIRDHARMONIC_Ib] = Ib3;
    g_TelemetryDB[THIRDHARMONIC_Ic] = Ic3;
    g_TelemetryDB[THIRDHARMONIC_I0] = I03;
    
    g_TelemetryDB[THIRDHARMONIC_Uca] = Ub5;
    g_TelemetryDB[THIRDHARMONIC_U0] = U05;
    g_TelemetryDB[THIRDHARMONIC_Ia] = Ia5;
    g_TelemetryDB[THIRDHARMONIC_Ib] = Ib5;
    g_TelemetryDB[THIRDHARMONIC_Ic] = Ic5;
    g_TelemetryDB[THIRDHARMONIC_I0] = I05;
    
#if RT_USING_TELEMETRY_SET    
    for (i = 0; i < TELEMETRY_TOTAL_NUM; i++)
    {
        if (g_TelemetrySetEnable[i] == SWITCH_ON)
        {
            g_TelemetryDB[i] = g_TelemetrySetValue[i];
        }
    }
#endif /* RT_USING_TELEMETRY_SET */ 
}


/* PUBLIC FUNCTION PROTOTYPES ------------------------------------------------*/
/**
  * @Description: AD7606采样值初始化.
  * @param:  无
  * @return: 无
  */
int calculate_init(void)
{
    arm_cfft_radix2_init_f32(&Scfft, 32, 0, 1); // 初始化Scfft结构体
    	
    return(RT_EOK);     
}
INIT_BOARD_EXPORT(calculate_init);

/**
  * @Description: 计算任务.
  * @param:  无
  * @return: 无
  * @updata: [YYYY-MM-DD] [更改人姓名][变更描述]
  */
void CalcultateTask(void)
{
    CalculateData();

    /* 系数校准 */
    CalibrationFactorCal(g_CalibrateFactorCfg_Len);
}

/* END OF FILE ---------------------------------------------------------------*/
